
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/hayas1/tfgh/actions/runs/11879212643)



<pre><code>Apply complete! Resources: 5 added, 17 changed, 5 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
module.repositories["dyson-rs"].github_repository.this: Refreshing state... [id=dyson-rs]
module.repositories["tokei-toukei"].github_repository.this: Refreshing state... [id=tokei-toukei]
module.repositories["tfgh"].github_repository.this: Refreshing state... [id=tfgh]
module.repositories["json-with-comments"].github_repository.this: Refreshing state... [id=json-with-comments]
module.repositories["devcontainer-features"].github_repository.this: Refreshing state... [id=devcontainer-features]
module.repositories["dyson-rs"].github_branch_default.this: Refreshing state... [id=dyson-rs]
module.repositories["tfgh"].github_repository_ruleset.this: Refreshing state... [id=2558597]
module.repositories["dyson-rs"].github_repository_ruleset.this: Refreshing state... [id=2589508]
module.repositories["devcontainer-features"].github_branch_default.this: Refreshing state... [id=devcontainer-features]
module.repositories["tokei-toukei"].github_branch_default.this: Refreshing state... [id=tokei-toukei]
module.repositories["json-with-comments"].github_branch_default.this: Refreshing state... [id=json-with-comments]
module.repositories["json-with-comments"].github_repository_ruleset.this: Refreshing state... [id=2629668]
module.repositories["devcontainer-features"].github_repository_ruleset.this: Refreshing state... [id=2602488]
module.repositories["tfgh"].github_branch_default.this: Refreshing state... [id=tfgh]
module.repositories["tokei-toukei"].github_repository_ruleset.this: Refreshing state... [id=2639488]
module.repositories["tokei-toukei"].github_issue_label.this["refactor"]: Refreshing state... [id=tokei-toukei:refactor]
module.repositories["dyson-rs"].github_issue_label.this["feature"]: Refreshing state... [id=dyson-rs:feature]
module.repositories["tfgh"].github_issue_label.this["breaking"]: Refreshing state... [id=tfgh:breaking]
module.repositories["devcontainer-features"].github_issue_label.this["bugfix"]: Refreshing state... [id=devcontainer-features:bugfix]
module.repositories["json-with-comments"].github_issue_label.this["deps"]: Refreshing state... [id=json-with-comments:deps]
module.repositories["json-with-comments"].github_issue_label.this["refactor"]: Refreshing state... [id=json-with-comments:refactor]
module.repositories["json-with-comments"].github_issue_label.this["breaking"]: Refreshing state... [id=json-with-comments:breaking]
module.repositories["dyson-rs"].github_issue_label.this["maintenance"]: Refreshing state... [id=dyson-rs:maintenance]
module.repositories["json-with-comments"].github_issue_label.this["bugfix"]: Refreshing state... [id=json-with-comments:bugfix]
module.repositories["tokei-toukei"].github_issue_label.this["maintenance"]: Refreshing state... [id=tokei-toukei:maintenance]
module.repositories["tfgh"].github_issue_label.this["feature"]: Refreshing state... [id=tfgh:feature]
module.repositories["devcontainer-features"].github_issue_label.this["deps"]: Refreshing state... [id=devcontainer-features:deps]
module.repositories["devcontainer-features"].github_issue_label.this["refactor"]: Refreshing state... [id=devcontainer-features:refactor]
module.repositories["json-with-comments"].github_issue_label.this["maintenance"]: Refreshing state... [id=json-with-comments:maintenance]
module.repositories["devcontainer-features"].github_issue_label.this["maintenance"]: Refreshing state... [id=devcontainer-features:maintenance]
module.repositories["tfgh"].github_issue_label.this["refactor"]: Refreshing state... [id=tfgh:refactor]
module.repositories["dyson-rs"].github_issue_label.this["bugfix"]: Refreshing state... [id=dyson-rs:bugfix]
module.repositories["tfgh"].github_issue_label.this["documentation"]: Refreshing state... [id=tfgh:documentation]
module.repositories["dyson-rs"].github_issue_label.this["breaking"]: Refreshing state... [id=dyson-rs:breaking]
module.repositories["tokei-toukei"].github_issue_label.this["feature"]: Refreshing state... [id=tokei-toukei:feature]
module.repositories["dyson-rs"].github_issue_label.this["refactor"]: Refreshing state... [id=dyson-rs:refactor]
module.repositories["json-with-comments"].github_issue_label.this["feature"]: Refreshing state... [id=json-with-comments:feature]
module.repositories["devcontainer-features"].github_issue_label.this["documentation"]: Refreshing state... [id=devcontainer-features:documentation]
module.repositories["json-with-comments"].github_issue_label.this["documentation"]: Refreshing state... [id=json-with-comments:documentation]
module.repositories["tokei-toukei"].github_issue_label.this["breaking"]: Refreshing state... [id=tokei-toukei:breaking]
module.repositories["tokei-toukei"].github_issue_label.this["bugfix"]: Refreshing state... [id=tokei-toukei:bugfix]
module.repositories["tfgh"].github_issue_label.this["deps"]: Refreshing state... [id=tfgh:deps]
module.repositories["tokei-toukei"].github_issue_label.this["deps"]: Refreshing state... [id=tokei-toukei:deps]
module.repositories["tokei-toukei"].github_issue_label.this["documentation"]: Refreshing state... [id=tokei-toukei:documentation]
module.repositories["dyson-rs"].github_issue_label.this["deps"]: Refreshing state... [id=dyson-rs:deps]
module.repositories["devcontainer-features"].github_issue_label.this["feature"]: Refreshing state... [id=devcontainer-features:feature]
module.repositories["tfgh"].github_issue_label.this["bugfix"]: Refreshing state... [id=tfgh:bugfix]
module.repositories["devcontainer-features"].github_issue_label.this["breaking"]: Refreshing state... [id=devcontainer-features:breaking]
module.repositories["dyson-rs"].github_issue_label.this["documentation"]: Refreshing state... [id=dyson-rs:documentation]
module.repositories["tfgh"].github_issue_label.this["maintenance"]: Refreshing state... [id=tfgh:maintenance]
module.repositories["tfgh"].github_repository_file.this["github/pull_request_template.md"]: Refreshing state... [id=tfgh/.github/pull_request_template.md]
module.repositories["dyson-rs"].github_repository_file.this["github/pull_request_template.md"]: Refreshing state... [id=dyson-rs/.github/pull_request_template.md]
module.repositories["devcontainer-features"].github_repository_file.this["github/issue_template.md"]: Refreshing state... [id=devcontainer-features/.github/issue_template.md]
module.repositories["devcontainer-features"].github_repository_file.this["github/release.yml"]: Refreshing state... [id=devcontainer-features/.github/release.yml]
module.repositories["json-with-comments"].github_repository_file.this["github/pull_request_template.md"]: Refreshing state... [id=json-with-comments/.github/pull_request_template.md]
module.repositories["dyson-rs"].github_repository_file.this["github/labeler.yml"]: Refreshing state... [id=dyson-rs/.github/labeler.yml]
module.repositories["tfgh"].github_repository_file.this["github/labeler.yml"]: Refreshing state... [id=tfgh/.github/labeler.yml]
module.repositories["tokei-toukei"].github_repository_file.this["github/issue_template.md"]: Refreshing state... [id=tokei-toukei/.github/issue_template.md]
module.repositories["dyson-rs"].github_repository_file.this["github/issue_template.md"]: Refreshing state... [id=dyson-rs/.github/issue_template.md]
module.repositories["tokei-toukei"].github_repository_file.this["github/pull_request_template.md"]: Refreshing state... [id=tokei-toukei/.github/pull_request_template.md]
module.repositories["json-with-comments"].github_repository_file.this["github/release.yml"]: Refreshing state... [id=json-with-comments/.github/release.yml]
module.repositories["tfgh"].github_repository_file.this["github/workflows/labeler.yml"]: Refreshing state... [id=tfgh/.github/workflows/labeler.yml]
module.repositories["devcontainer-features"].github_repository_file.this["github/labeler.yml"]: Refreshing state... [id=devcontainer-features/.github/labeler.yml]
module.repositories["json-with-comments"].github_repository_file.this["github/labeler.yml"]: Refreshing state... [id=json-with-comments/.github/labeler.yml]
module.repositories["tfgh"].github_repository_file.this["github/issue_template.md"]: Refreshing state... [id=tfgh/.github/issue_template.md]
module.repositories["dyson-rs"].github_repository_file.this["github/workflows/labeler.yml"]: Refreshing state... [id=dyson-rs/.github/workflows/labeler.yml]
module.repositories["devcontainer-features"].github_repository_file.this["github/pull_request_template.md"]: Refreshing state... [id=devcontainer-features/.github/pull_request_template.md]
module.repositories["devcontainer-features"].github_repository_file.this["github/workflows/labeler.yml"]: Refreshing state... [id=devcontainer-features/.github/workflows/labeler.yml]
module.repositories["json-with-comments"].github_repository_file.this["github/issue_template.md"]: Refreshing state... [id=json-with-comments/.github/issue_template.md]
module.repositories["json-with-comments"].github_repository_file.this["github/workflows/labeler.yml"]: Refreshing state... [id=json-with-comments/.github/workflows/labeler.yml]
module.repositories["dyson-rs"].github_repository_file.this["github/release.yml"]: Refreshing state... [id=dyson-rs/.github/release.yml]
module.repositories["tfgh"].github_repository_file.this["github/release.yml"]: Refreshing state... [id=tfgh/.github/release.yml]
module.repositories["tokei-toukei"].github_repository_file.this["github/release.yml"]: Refreshing state... [id=tokei-toukei/.github/release.yml]
module.repositories["tokei-toukei"].github_repository_file.this["github/labeler.yml"]: Refreshing state... [id=tokei-toukei/.github/labeler.yml]
module.repositories["tokei-toukei"].github_repository_file.this["github/workflows/labeler.yml"]: Refreshing state... [id=tokei-toukei/.github/workflows/labeler.yml]
module.repositories["json-with-comments"].github_repository_pull_request.managed: Refreshing state... [id=hayas1:json-with-comments:47]
module.repositories["tokei-toukei"].github_repository_pull_request.managed: Refreshing state... [id=hayas1:tokei-toukei:28]
module.repositories["tfgh"].github_repository_pull_request.managed: Refreshing state... [id=hayas1:tfgh:78]
module.repositories["devcontainer-features"].github_repository_pull_request.managed: Refreshing state... [id=hayas1:devcontainer-features:44]
module.repositories["dyson-rs"].github_repository_pull_request.managed: Refreshing state... [id=hayas1:dyson-rs:12]
github_issue_label.manual: Refreshing state... [id=tfgh:manual]
github_repository_environment.plan: Refreshing state... [id=tfgh:plan]
github_repository_environment.apply: Refreshing state... [id=tfgh:apply]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.repositories["devcontainer-features"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"5e965b1b3c5d0e17781d3dd584c63a94f5048d8b6718e0ea00641ce1d7eb5464\"" -> "W/\"150f2911e630ee3e58dd77fc660fbab091789200bb32f5087f199029d9f15905\""
        id                          = "devcontainer-features"
        name                        = "devcontainer-features"
        # (35 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repositories["dyson-rs"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"39b5177be3311d5c4052df35754045337969e80d04edbfef2a6004de1d9f39ac\"" -> "W/\"09e66e147fedc1bfe32e1dda0d823df5f361445249f842d1335cff7041a264b8\""
        id                          = "dyson-rs"
        name                        = "dyson-rs"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.repositories["json-with-comments"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"0371bf2238fcfe41a8072578cc48c707b2bfb505e0748e07532edbd0e88ed8d4\"" -> "W/\"f09d0d3d18bab2004499e8f68b09e786fbaa949cd96f2fb4ad6b18aff06ce002\""
        id                          = "json-with-comments"
        name                        = "json-with-comments"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.repositories["tfgh"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"85241d2ecaca53c681bc9aba1612726b339ce9e5544ea4f3ace664f9ac9b56de\"" -> "W/\"96e29fce2d67846163ab1ad4e27ee36a3241d1a3c6862894b6b5bfba9fdc1cf9\""
        id                          = "tfgh"
        name                        = "tfgh"
        # (35 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repositories["tokei-toukei"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"e7550e5500dfa2a4c1fe804df1996ff004e48b20802877f13cd47af53278b357\"" -> "W/\"f24ec534bdd6823ae839c1c1e707b334d7db9a201a936fc5934f2503d1671b39\""
        id                          = "tokei-toukei"
        name                        = "tokei-toukei"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.repositories["devcontainer-features"].github_repository_file.this["github/issue_template.md"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      + autocreate_branch               = true
      + autocreate_branch_source_branch = "main"
        id                              = "devcontainer-features/.github/issue_template.md"
        # (9 unchanged attributes hidden)
    }

  # module.repositories["devcontainer-features"].github_repository_file.this["github/labeler.yml"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      + autocreate_branch               = true
      + autocreate_branch_source_branch = "main"
        id                              = "devcontainer-features/.github/labeler.yml"
        # (9 unchanged attributes hidden)
    }

  # module.repositories["devcontainer-features"].github_repository_file.this["github/pull_request_template.md"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      + autocreate_branch               = true
      + autocreate_branch_source_branch = "main"
        id                              = "devcontainer-features/.github/pull_request_template.md"
        # (9 unchanged attributes hidden)
    }

  # module.repositories["devcontainer-features"].github_repository_file.this["github/release.yml"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      + autocreate_branch               = true
      + autocreate_branch_source_branch = "main"
        id                              = "devcontainer-features/.github/release.yml"
        # (9 unchanged attributes hidden)
    }

  # module.repositories["devcontainer-features"].github_repository_file.this["github/workflows/labeler.yml"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      + autocreate_branch               = true
      + autocreate_branch_source_branch = "main"
        id                              = "devcontainer-features/.github/workflows/labeler.yml"
        # (9 unchanged attributes hidden)
    }

  # module.repositories["devcontainer-features"].github_repository_pull_request.managed will be replaced due to changes in replace_triggered_by
-/+ resource "github_repository_pull_request" "managed" {
      ~ base_sha              = "17c94619aa9e564db68be9ab2214dd5cf8b9d016" -> (known after apply)
      ~ draft                 = false -> (known after apply)
      ~ head_sha              = "6bd0dbe55e6f3b2cb7dd956cac5619ba7f4daf29" -> (known after apply)
      ~ id                    = "hayas1:devcontainer-features:44" -> (known after apply)
      ~ labels                = [
          - "maintenance",
        ] -> (known after apply)
      ~ number                = 44 -> (known after apply)
      ~ opened_at             = 1731847560 -> (known after apply)
      ~ opened_by             = "terraform-apply[bot]" -> (known after apply)
      ~ state                 = "open" -> (known after apply)
      ~ updated_at            = 1731847574 -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.repositories["dyson-rs"].github_repository_file.this["github/issue_template.md"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      + autocreate_branch               = true
      + autocreate_branch_source_branch = "master"
        id                              = "dyson-rs/.github/issue_template.md"
        # (9 unchanged attributes hidden)
    }

  # module.repositories["dyson-rs"].github_repository_pull_request.managed will be replaced due to changes in replace_triggered_by
-/+ resource "github_repository_pull_request" "managed" {
      ~ base_sha              = "d94a2b4dc8f49e29b32e8c7e9f43c3b58667fa8e" -> (known after apply)
      ~ draft                 = false -> (known after apply)
      ~ head_sha              = "bc1cb325f5d81be989c2fa18a521f93c17762884" -> (known after apply)
      ~ id                    = "hayas1:dyson-rs:12" -> (known after apply)
      ~ labels                = [
          - "documentation",
          - "maintenance",
        ] -> (known after apply)
      ~ number                = 12 -> (known after apply)
      ~ opened_at             = 1731847646 -> (known after apply)
      ~ opened_by             = "terraform-apply[bot]" -> (known after apply)
      ~ state                 = "open" -> (known after apply)
      ~ updated_at            = 1731847658 -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.repositories["json-with-comments"].github_repository_file.this["github/issue_template.md"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      + autocreate_branch               = true
      + autocreate_branch_source_branch = "master"
        id                              = "json-with-comments/.github/issue_template.md"
        # (9 unchanged attributes hidden)
    }

  # module.repositories["json-with-comments"].github_repository_file.this["github/labeler.yml"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      + autocreate_branch               = true
      + autocreate_branch_source_branch = "master"
        id                              = "json-with-comments/.github/labeler.yml"
        # (9 unchanged attributes hidden)
    }

  # module.repositories["json-with-comments"].github_repository_file.this["github/pull_request_template.md"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      + autocreate_branch               = true
      + autocreate_branch_source_branch = "master"
        id                              = "json-with-comments/.github/pull_request_template.md"
        # (9 unchanged attributes hidden)
    }

  # module.repositories["json-with-comments"].github_repository_file.this["github/release.yml"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      + autocreate_branch               = true
      + autocreate_branch_source_branch = "master"
        id                              = "json-with-comments/.github/release.yml"
        # (9 unchanged attributes hidden)
    }

  # module.repositories["json-with-comments"].github_repository_file.this["github/workflows/labeler.yml"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      + autocreate_branch               = true
      + autocreate_branch_source_branch = "master"
        id                              = "json-with-comments/.github/workflows/labeler.yml"
        # (9 unchanged attributes hidden)
    }

  # module.repositories["json-with-comments"].github_repository_pull_request.managed will be replaced due to changes in replace_triggered_by
-/+ resource "github_repository_pull_request" "managed" {
      ~ base_sha              = "5cc937a63844a086691695303161c7ae382336d9" -> (known after apply)
      ~ draft                 = false -> (known after apply)
      ~ head_sha              = "108778d38e20245713a2db936b332b9b538abcc3" -> (known after apply)
      ~ id                    = "hayas1:json-with-comments:47" -> (known after apply)
      ~ labels                = [
          - "maintenance",
        ] -> (known after apply)
      ~ number                = 47 -> (known after apply)
      ~ opened_at             = 1731847644 -> (known after apply)
      ~ opened_by             = "terraform-apply[bot]" -> (known after apply)
      ~ state                 = "open" -> (known after apply)
      ~ updated_at            = 1731847655 -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.repositories["tfgh"].github_repository_file.this["github/issue_template.md"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      + autocreate_branch               = true
      + autocreate_branch_source_branch = "main"
        id                              = "tfgh/.github/issue_template.md"
        # (9 unchanged attributes hidden)
    }

  # module.repositories["tfgh"].github_repository_pull_request.managed will be replaced due to changes in replace_triggered_by
-/+ resource "github_repository_pull_request" "managed" {
      ~ base_sha              = "5c04e8d30193b02717adec19caf6df406a8d8701" -> (known after apply)
      ~ draft                 = false -> (known after apply)
      ~ head_sha              = "f16d3301f0e542caf1df8907e8781d2aa4a1e364" -> (known after apply)
      ~ id                    = "hayas1:tfgh:78" -> (known after apply)
      ~ labels                = [
          - "no-changes",
          - "maintenance",
        ] -> (known after apply)
      ~ number                = 78 -> (known after apply)
      ~ opened_at             = 1731847648 -> (known after apply)
      ~ opened_by             = "terraform-apply[bot]" -> (known after apply)
      ~ state                 = "open" -> (known after apply)
      ~ updated_at            = 1731847713 -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.repositories["tokei-toukei"].github_repository_file.this["github/issue_template.md"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      + autocreate_branch               = true
      + autocreate_branch_source_branch = "master"
        id                              = "tokei-toukei/.github/issue_template.md"
        # (9 unchanged attributes hidden)
    }

  # module.repositories["tokei-toukei"].github_repository_file.this["github/labeler.yml"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      + autocreate_branch               = true
      + autocreate_branch_source_branch = "master"
        id                              = "tokei-toukei/.github/labeler.yml"
        # (9 unchanged attributes hidden)
    }

  # module.repositories["tokei-toukei"].github_repository_file.this["github/pull_request_template.md"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      + autocreate_branch               = true
      + autocreate_branch_source_branch = "master"
        id                              = "tokei-toukei/.github/pull_request_template.md"
        # (9 unchanged attributes hidden)
    }

  # module.repositories["tokei-toukei"].github_repository_file.this["github/release.yml"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      + autocreate_branch               = true
      + autocreate_branch_source_branch = "master"
        id                              = "tokei-toukei/.github/release.yml"
        # (9 unchanged attributes hidden)
    }

  # module.repositories["tokei-toukei"].github_repository_file.this["github/workflows/labeler.yml"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      + autocreate_branch               = true
      + autocreate_branch_source_branch = "master"
        id                              = "tokei-toukei/.github/workflows/labeler.yml"
        # (9 unchanged attributes hidden)
    }

  # module.repositories["tokei-toukei"].github_repository_pull_request.managed will be replaced due to changes in replace_triggered_by
-/+ resource "github_repository_pull_request" "managed" {
      ~ base_sha              = "d0b3dbb3471c681e30c750be2eba289e1e17593e" -> (known after apply)
      ~ draft                 = false -> (known after apply)
      ~ head_sha              = "fd1ae488c58f609419267818f67342d80d7d9071" -> (known after apply)
      ~ id                    = "hayas1:tokei-toukei:28" -> (known after apply)
      ~ labels                = [
          - "maintenance",
        ] -> (known after apply)
      ~ number                = 28 -> (known after apply)
      ~ opened_at             = 1731847649 -> (known after apply)
      ~ opened_by             = "terraform-apply[bot]" -> (known after apply)
      ~ state                 = "open" -> (known after apply)
      ~ updated_at            = 1731847660 -> (known after apply)
        # (6 unchanged attributes hidden)
    }

Plan: 5 to add, 17 to change, 5 to destroy.
module.repositories["dyson-rs"].github_repository_pull_request.managed: Destroying... [id=hayas1:dyson-rs:12]
module.repositories["tfgh"].github_repository_pull_request.managed: Destroying... [id=hayas1:tfgh:78]
module.repositories["json-with-comments"].github_repository_pull_request.managed: Destroying... [id=hayas1:json-with-comments:47]
module.repositories["devcontainer-features"].github_repository_pull_request.managed: Destroying... [id=hayas1:devcontainer-features:44]
module.repositories["tokei-toukei"].github_repository_pull_request.managed: Destroying... [id=hayas1:tokei-toukei:28]
module.repositories["dyson-rs"].github_repository_pull_request.managed: Destruction complete after 1s
module.repositories["dyson-rs"].github_repository_file.this["github/issue_template.md"]: Modifying... [id=dyson-rs/.github/issue_template.md]
module.repositories["tfgh"].github_repository_pull_request.managed: Destruction complete after 3s
module.repositories["tfgh"].github_repository_file.this["github/issue_template.md"]: Modifying... [id=tfgh/.github/issue_template.md]
module.repositories["devcontainer-features"].github_repository_pull_request.managed: Destruction complete after 4s
module.repositories["devcontainer-features"].github_repository_file.this["github/pull_request_template.md"]: Modifying... [id=devcontainer-features/.github/pull_request_template.md]
module.repositories["devcontainer-features"].github_repository_file.this["github/labeler.yml"]: Modifying... [id=devcontainer-features/.github/labeler.yml]
module.repositories["devcontainer-features"].github_repository_file.this["github/issue_template.md"]: Modifying... [id=devcontainer-features/.github/issue_template.md]
module.repositories["devcontainer-features"].github_repository_file.this["github/workflows/labeler.yml"]: Modifying... [id=devcontainer-features/.github/workflows/labeler.yml]
module.repositories["devcontainer-features"].github_repository_file.this["github/release.yml"]: Modifying... [id=devcontainer-features/.github/release.yml]
module.repositories["tokei-toukei"].github_repository_pull_request.managed: Destruction complete after 6s
module.repositories["tokei-toukei"].github_repository_file.this["github/issue_template.md"]: Modifying... [id=tokei-toukei/.github/issue_template.md]
module.repositories["tokei-toukei"].github_repository_file.this["github/workflows/labeler.yml"]: Modifying... [id=tokei-toukei/.github/workflows/labeler.yml]
module.repositories["json-with-comments"].github_repository_pull_request.managed: Destruction complete after 8s
module.repositories["tokei-toukei"].github_repository_file.this["github/release.yml"]: Modifying... [id=tokei-toukei/.github/release.yml]
module.repositories["dyson-rs"].github_repository_file.this["github/issue_template.md"]: Still modifying... [id=dyson-rs/.github/issue_template.md, 10s elapsed]
module.repositories["tfgh"].github_repository_file.this["github/issue_template.md"]: Still modifying... [id=tfgh/.github/issue_template.md, 10s elapsed]
module.repositories["devcontainer-features"].github_repository_file.this["github/pull_request_template.md"]: Still modifying... [id=devcontainer-features/.github/pull_request_template.md, 10s elapsed]
module.repositories["devcontainer-features"].github_repository_file.this["github/labeler.yml"]: Still modifying... [id=devcontainer-features/.github/labeler.yml, 10s elapsed]
module.repositories["devcontainer-features"].github_repository_file.this["github/issue_template.md"]: Still modifying... [id=devcontainer-features/.github/issue_template.md, 10s elapsed]
module.repositories["devcontainer-features"].github_repository_file.this["github/release.yml"]: Still modifying... [id=devcontainer-features/.github/release.yml, 10s elapsed]
module.repositories["devcontainer-features"].github_repository_file.this["github/workflows/labeler.yml"]: Still modifying... [id=devcontainer-features/.github/workflows/labeler.yml, 10s elapsed]
module.repositories["tokei-toukei"].github_repository_file.this["github/issue_template.md"]: Still modifying... [id=tokei-toukei/.github/issue_template.md, 10s elapsed]
module.repositories["tokei-toukei"].github_repository_file.this["github/workflows/labeler.yml"]: Still modifying... [id=tokei-toukei/.github/workflows/labeler.yml, 10s elapsed]
module.repositories["tokei-toukei"].github_repository_file.this["github/release.yml"]: Still modifying... [id=tokei-toukei/.github/release.yml, 10s elapsed]
module.repositories["dyson-rs"].github_repository_file.this["github/issue_template.md"]: Still modifying... [id=dyson-rs/.github/issue_template.md, 20s elapsed]
module.repositories["tfgh"].github_repository_file.this["github/issue_template.md"]: Still modifying... [id=tfgh/.github/issue_template.md, 20s elapsed]
module.repositories["devcontainer-features"].github_repository_file.this["github/pull_request_template.md"]: Still modifying... [id=devcontainer-features/.github/pull_request_template.md, 20s elapsed]
module.repositories["devcontainer-features"].github_repository_file.this["github/labeler.yml"]: Still modifying... [id=devcontainer-features/.github/labeler.yml, 20s elapsed]
module.repositories["devcontainer-features"].github_repository_file.this["github/issue_template.md"]: Still modifying... [id=devcontainer-features/.github/issue_template.md, 20s elapsed]
module.repositories["devcontainer-features"].github_repository_file.this["github/release.yml"]: Still modifying... [id=devcontainer-features/.github/release.yml, 20s elapsed]
module.repositories["devcontainer-features"].github_repository_file.this["github/workflows/labeler.yml"]: Still modifying... [id=devcontainer-features/.github/workflows/labeler.yml, 20s elapsed]
module.repositories["dyson-rs"].github_repository_file.this["github/issue_template.md"]: Modifications complete after 25s [id=dyson-rs/.github/issue_template.md]
module.repositories["tokei-toukei"].github_repository_file.this["github/pull_request_template.md"]: Modifying... [id=tokei-toukei/.github/pull_request_template.md]
module.repositories["tokei-toukei"].github_repository_file.this["github/workflows/labeler.yml"]: Still modifying... [id=tokei-toukei/.github/workflows/labeler.yml, 20s elapsed]
module.repositories["tokei-toukei"].github_repository_file.this["github/issue_template.md"]: Still modifying... [id=tokei-toukei/.github/issue_template.md, 20s elapsed]
module.repositories["tfgh"].github_repository_file.this["github/issue_template.md"]: Modifications complete after 23s [id=tfgh/.github/issue_template.md]
module.repositories["tokei-toukei"].github_repository_file.this["github/labeler.yml"]: Modifying... [id=tokei-toukei/.github/labeler.yml]
module.repositories["devcontainer-features"].github_repository_file.this["github/labeler.yml"]: Modifications complete after 22s [id=devcontainer-features/.github/labeler.yml]
module.repositories["json-with-comments"].github_repository_file.this["github/release.yml"]: Modifying... [id=json-with-comments/.github/release.yml]
module.repositories["devcontainer-features"].github_repository_file.this["github/pull_request_template.md"]: Modifications complete after 22s [id=devcontainer-features/.github/pull_request_template.md]
module.repositories["json-with-comments"].github_repository_file.this["github/pull_request_template.md"]: Modifying... [id=json-with-comments/.github/pull_request_template.md]
module.repositories["devcontainer-features"].github_repository_file.this["github/issue_template.md"]: Modifications complete after 23s [id=devcontainer-features/.github/issue_template.md]
module.repositories["json-with-comments"].github_repository_file.this["github/labeler.yml"]: Modifying... [id=json-with-comments/.github/labeler.yml]
module.repositories["devcontainer-features"].github_repository_file.this["github/workflows/labeler.yml"]: Modifications complete after 23s [id=devcontainer-features/.github/workflows/labeler.yml]
module.repositories["json-with-comments"].github_repository_file.this["github/workflows/labeler.yml"]: Modifying... [id=json-with-comments/.github/workflows/labeler.yml]
module.repositories["devcontainer-features"].github_repository_file.this["github/release.yml"]: Modifications complete after 23s [id=devcontainer-features/.github/release.yml]
module.repositories["json-with-comments"].github_repository_file.this["github/issue_template.md"]: Modifying... [id=json-with-comments/.github/issue_template.md]
module.repositories["tokei-toukei"].github_repository_file.this["github/workflows/labeler.yml"]: Modifications complete after 21s [id=tokei-toukei/.github/workflows/labeler.yml]
module.repositories["tokei-toukei"].github_repository_file.this["github/issue_template.md"]: Modifications complete after 21s [id=tokei-toukei/.github/issue_template.md]
module.repositories["tokei-toukei"].github_repository_file.this["github/release.yml"]: Modifications complete after 19s [id=tokei-toukei/.github/release.yml]
module.repositories["tokei-toukei"].github_repository_file.this["github/pull_request_template.md"]: Still modifying... [id=tokei-toukei/.github/pull_request_template.md, 10s elapsed]
module.repositories["tokei-toukei"].github_repository_file.this["github/labeler.yml"]: Still modifying... [id=tokei-toukei/.github/labeler.yml, 10s elapsed]
module.repositories["json-with-comments"].github_repository_file.this["github/release.yml"]: Still modifying... [id=json-with-comments/.github/release.yml, 10s elapsed]
module.repositories["json-with-comments"].github_repository_file.this["github/pull_request_template.md"]: Still modifying... [id=json-with-comments/.github/pull_request_template.md, 10s elapsed]
module.repositories["json-with-comments"].github_repository_file.this["github/labeler.yml"]: Still modifying... [id=json-with-comments/.github/labeler.yml, 10s elapsed]
module.repositories["json-with-comments"].github_repository_file.this["github/workflows/labeler.yml"]: Still modifying... [id=json-with-comments/.github/workflows/labeler.yml, 10s elapsed]
module.repositories["json-with-comments"].github_repository_file.this["github/issue_template.md"]: Still modifying... [id=json-with-comments/.github/issue_template.md, 10s elapsed]
module.repositories["tokei-toukei"].github_repository_file.this["github/pull_request_template.md"]: Modifications complete after 13s [id=tokei-toukei/.github/pull_request_template.md]
module.repositories["tokei-toukei"].github_repository_file.this["github/labeler.yml"]: Modifications complete after 13s [id=tokei-toukei/.github/labeler.yml]
module.repositories["json-with-comments"].github_repository_file.this["github/release.yml"]: Modifications complete after 13s [id=json-with-comments/.github/release.yml]
module.repositories["json-with-comments"].github_repository_file.this["github/pull_request_template.md"]: Modifications complete after 13s [id=json-with-comments/.github/pull_request_template.md]
module.repositories["json-with-comments"].github_repository_file.this["github/labeler.yml"]: Modifications complete after 13s [id=json-with-comments/.github/labeler.yml]
module.repositories["json-with-comments"].github_repository_file.this["github/workflows/labeler.yml"]: Modifications complete after 13s [id=json-with-comments/.github/workflows/labeler.yml]
module.repositories["json-with-comments"].github_repository_file.this["github/issue_template.md"]: Modifications complete after 13s [id=json-with-comments/.github/issue_template.md]
module.repositories["devcontainer-features"].github_repository_pull_request.managed: Creating...
module.repositories["dyson-rs"].github_repository_pull_request.managed: Creating...
module.repositories["tfgh"].github_repository_pull_request.managed: Creating...
module.repositories["tokei-toukei"].github_repository_pull_request.managed: Creating...
module.repositories["json-with-comments"].github_repository_pull_request.managed: Creating...
module.repositories["devcontainer-features"].github_repository_pull_request.managed: Creation complete after 8s [id=hayas1:devcontainer-features:45]
module.repositories["dyson-rs"].github_repository_pull_request.managed: Creation complete after 9s [id=hayas1:dyson-rs:13]
module.repositories["tfgh"].github_repository_pull_request.managed: Creation complete after 9s [id=hayas1:tfgh:80]
module.repositories["tokei-toukei"].github_repository_pull_request.managed: Creation complete after 9s [id=hayas1:tokei-toukei:29]
module.repositories["json-with-comments"].github_repository_pull_request.managed: Creation complete after 10s [id=hayas1:json-with-comments:48]

Apply complete! Resources: 5 added, 17 changed, 5 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":79,"Program":"tfcmt","SHA1":"9c481079887745e7321323c5eeb9176f391b5513","Vars":{},"WorkflowName":"Terraform apply on push"} -->